wosayttn/M55M1BSP/_CUnit/i2s/i2s_cunit.c
/*----------------------------------------------------------------------------*/
/*                                                                            */
/* Copyright (C) 2014 Nuvoton Technology Corp. All rights reserved.           */
/*                                                                            */
/*----------------------------------------------------------------------------*/
/* File Contents:                                                                                          */
/*   i2s_cunit.c                                                                                           */
/*            The test function of I2S for CUnit.                                                          */
/* Project:   NUC123                                                                                       */
/*----------------------------------------------------------------------------*/

/*----------------------------------------------------------------------------*/
/* Includes of system headers                                                 */
/*----------------------------------------------------------------------------*/
#include <stdio.h>
#include <stdlib.h>
#include <assert.h>

/*----------------------------------------------------------------------------*/
/* Includes of local headers                                                  */
/*----------------------------------------------------------------------------*/
#include "NuMicro.h"
#include "CUnit.h"
#include "Console.h"
#include "i2s_cunit.h"

//------------------------------------------------------------------------------
extern unsigned int STATE0;
extern unsigned int STATE1;
extern unsigned int ERR_STATE0;
extern unsigned int ERR_STATE1;

//------------------------------------------------------------------------------
#define C_I2S0                          0
#define C_I2S1                          1

//------------------------------------------------------------------------------
I2S_T *g_apI2sModule[] =
{
    I2S0,
    I2S1,
};

/*----------------------------------------------------------------------------*/
/* Test function                                                              */
/*----------------------------------------------------------------------------*/
void *GetI2SModuel(uint32_t u32Idx)
{
    return g_apI2sModule[u32Idx];
}

void ResetI2SModule(uint32_t u32I2SModule)
{
    /* Unlock protected registers */
    SYS_UnlockReg();

    switch (u32I2SModule)
    {
        case C_I2S0:
            SYS->I2SRST |= SYS_I2SRST_I2S0RST_Msk;
            SYS->I2SRST &= (~SYS_I2SRST_I2S0RST_Msk);
            break;

#if (I2S1_GROUP != 0)

        case C_I2S1:
            SYS->I2SRST |= SYS_I2SRST_I2S1RST_Msk;
            SYS->I2SRST &= (~SYS_I2SRST_I2S1RST_Msk);
            break;
#endif //I2S1_GROUP
    }

    /* Lock protected registers */
    SYS_LockReg();
}

int I2S_Tests_Init(void)
{
    return 0;
}
int I2S_Tests_Clean(void)
{
    return 0;
}

/*----------------------------------------------------------------------------*/
/* Function: function_name                                                    */
/*                                                                            */
/* Parameters:                                                                */
/*               param - [in/out], parameter_description                      */
/*               param - [in/out], parameter_description                      */
/*                                                                            */
/* Returns:      the_value                                                    */
/* Side effects: the_effect                                                   */
/* Description:                                                               */
/*               description                                                  */
/*----------------------------------------------------------------------------*/

CU_SuiteInfo suites[] =
{
    {"I2S MACRO", I2S_Tests_Init, I2S_Tests_Clean, NULL, NULL, I2S_MacroTests},
    {"I2S API", I2S_Tests_Init, I2S_Tests_Clean, NULL, NULL, I2S_ApiTests},
    CU_SUITE_INFO_NULL
};

void MACRO_I2S_ENABLE_DISABLE_TX_ZCD()
{
    uint32_t u32I2SIdx = 0;
    I2S_T *pI2SModule = NULL;

    for (u32I2SIdx = 0; u32I2SIdx < sizeof(g_apI2sModule) / sizeof(I2S_T *); u32I2SIdx++)
    {
        pI2SModule = (I2S_T *)GetI2SModuel(u32I2SIdx);

        I2S_ENABLE_TX_ZCD(pI2SModule, 1);

        CU_ASSERT_TRUE(pI2SModule->CTL1 & 0x00000001);

        I2S_DISABLE_TX_ZCD(pI2SModule, 2);

        CU_ASSERT_FALSE(pI2SModule->CTL1 & 0x00000002);

        I2S_ENABLE_TX_ZCD(pI2SModule, 3);

        CU_ASSERT_TRUE(pI2SModule->CTL1 & 0x00000004);

        I2S_DISABLE_TX_ZCD(pI2SModule, 4);

        CU_ASSERT_FALSE(pI2SModule->CTL1 & 0x00000008);

        I2S_ENABLE_TX_ZCD(pI2SModule, 5);

        CU_ASSERT_TRUE(pI2SModule->CTL1 & 0x00000010);

        I2S_DISABLE_TX_ZCD(pI2SModule, 6);

        CU_ASSERT_FALSE(pI2SModule->CTL1 & 0x00000020);

        I2S_ENABLE_TX_ZCD(pI2SModule, 7);

        CU_ASSERT_TRUE(pI2SModule->CTL1 & 0x00000040);

        I2S_DISABLE_TX_ZCD(pI2SModule, 8);

        CU_ASSERT_FALSE(pI2SModule->CTL1 & 0x00000080);
    }
}

void MACRO_I2S_ENABLE_DISABLE_TXDMA()
{
    uint32_t u32I2SIdx = 0;
    I2S_T *pI2SModule = NULL;

    for (u32I2SIdx = 0; u32I2SIdx < sizeof(g_apI2sModule) / sizeof(I2S_T *); u32I2SIdx++)
    {
        pI2SModule = (I2S_T *)GetI2SModuel(u32I2SIdx);

        I2S_ENABLE_TXDMA(pI2SModule);

        CU_ASSERT_TRUE(pI2SModule->CTL0 & 0x00100000);

        I2S_DISABLE_TXDMA(pI2SModule);

        CU_ASSERT_FALSE(pI2SModule->CTL0 & 0x00100000);
    }
}

void MACRO_I2S_ENABLE_DISABLE_RXDMA()
{
    uint32_t u32I2SIdx = 0;
    I2S_T *pI2SModule = NULL;

    for (u32I2SIdx = 0; u32I2SIdx < sizeof(g_apI2sModule) / sizeof(I2S_T *); u32I2SIdx++)
    {
        pI2SModule = (I2S_T *)GetI2SModuel(u32I2SIdx);

        I2S_ENABLE_RXDMA(pI2SModule);

        CU_ASSERT_TRUE(pI2SModule->CTL0 & 0x00200000);

