wosayttn/M55M1BSP/_CUnit/i2s/i2s_cunit.c
        I2S_DISABLE_RXDMA(pI2SModule);

        CU_ASSERT_FALSE(pI2SModule->CTL0 & 0x00200000);
    }
}

void MACRO_I2S_ENABLE_DISABLE_TX()
{
    uint32_t u32I2SIdx = 0;
    I2S_T *pI2SModule = NULL;

    for (u32I2SIdx = 0; u32I2SIdx < sizeof(g_apI2sModule) / sizeof(I2S_T *); u32I2SIdx++)
    {
        pI2SModule = (I2S_T *)GetI2SModuel(u32I2SIdx);

        I2S_ENABLE_TX(pI2SModule);

        CU_ASSERT_TRUE(pI2SModule->CTL0 & 2);

        I2S_DISABLE_TX(pI2SModule);

        CU_ASSERT_FALSE(pI2SModule->CTL0 & 2);
    }
}

void MACRO_I2S_ENABLE_DISABLE_RX()
{
    uint32_t u32I2SIdx = 0;
    I2S_T *pI2SModule = NULL;

    for (u32I2SIdx = 0; u32I2SIdx < sizeof(g_apI2sModule) / sizeof(I2S_T *); u32I2SIdx++)
    {
        pI2SModule = (I2S_T *)GetI2SModuel(u32I2SIdx);

        I2S_ENABLE_RX(pI2SModule);

        CU_ASSERT_TRUE(pI2SModule->CTL0 & 4);

        I2S_DISABLE_RX(pI2SModule);

        CU_ASSERT_FALSE(pI2SModule->CTL0 & 4);
    }
}

void MACRO_I2S_ENABLE_DISABLE_TX_MUTE()
{
    uint32_t u32I2SIdx = 0;
    I2S_T *pI2SModule = NULL;

    for (u32I2SIdx = 0; u32I2SIdx < sizeof(g_apI2sModule) / sizeof(I2S_T *); u32I2SIdx++)
    {
        pI2SModule = (I2S_T *)GetI2SModuel(u32I2SIdx);

        I2S_ENABLE_TX_MUTE(pI2SModule);

        CU_ASSERT_TRUE(pI2SModule->CTL0 & 8);

        I2S_DISABLE_TX_MUTE(pI2SModule);

        CU_ASSERT_FALSE(pI2SModule->CTL0 & 8);
    }
}

void MACRO_I2S_CLR_TX_FIFO()
{
    uint32_t u32I2SIdx = 0;
    I2S_T *pI2SModule = NULL;

    for (u32I2SIdx = 0; u32I2SIdx < sizeof(g_apI2sModule) / sizeof(I2S_T *); u32I2SIdx++)
    {
        pI2SModule = (I2S_T *)GetI2SModuel(u32I2SIdx);

        /* Write 3 data to TX FIFO */
        I2S_WRITE_TX_FIFO(pI2SModule, 1);
        I2S_WRITE_TX_FIFO(pI2SModule, 2);
        I2S_WRITE_TX_FIFO(pI2SModule, 3);

        I2S_CLR_TX_FIFO(pI2SModule);

        CU_ASSERT(I2S_GET_TX_FIFO_LEVEL(pI2SModule) == 0);
        /* CLR_TXFIFO bit should be cleared by hardware automatically */
        CU_ASSERT_FALSE(pI2SModule->CTL0 & 0x00040000);
    }
}

void MACRO_I2S_CLR_RX_FIFO()
{
    uint32_t u32I2SIdx = 0;
    I2S_T *pI2SModule = NULL;

    for (u32I2SIdx = 0; u32I2SIdx < sizeof(g_apI2sModule) / sizeof(I2S_T *); u32I2SIdx++)
    {
        pI2SModule = (I2S_T *)GetI2SModuel(u32I2SIdx);

        /* Enable I2S RX function */
        pI2SModule->CTL0 = 5;

        while (pI2SModule->STATUS0 & I2S_STATUS0_RXEMPTY_Msk);

        /* Disable I2S RX function */
        pI2SModule->CTL0 = 0;

        I2S_CLR_RX_FIFO(pI2SModule);

        CU_ASSERT(I2S_GET_RX_FIFO_LEVEL(pI2SModule) == 0);
        /* CLR_RXFIFO bit should be cleared by hardware automatically */
        CU_ASSERT_FALSE(pI2SModule->CTL0 & 0x00080000);
    }
}

void MACRO_I2S_SET_MONO_RX_CHANNEL()
{
    uint32_t u32I2SIdx = 0;
    I2S_T *pI2SModule = NULL;

    for (u32I2SIdx = 0; u32I2SIdx < sizeof(g_apI2sModule) / sizeof(I2S_T *); u32I2SIdx++)
    {
        pI2SModule = (I2S_T *)GetI2SModuel(u32I2SIdx);

        I2S_SET_MONO_RX_CHANNEL(pI2SModule, I2S_MONO_LEFT);

        CU_ASSERT_TRUE(pI2SModule->CTL0 & 0x00800000);

        I2S_SET_MONO_RX_CHANNEL(pI2SModule, I2S_MONO_RIGHT);

        CU_ASSERT_FALSE(pI2SModule->CTL0 & 0x00800000);
    }
}

void MACRO_I2S_WRITE_TX_FIFO()
{
    uint32_t u32I2SIdx = 0;
    I2S_T *pI2SModule = NULL;

    for (u32I2SIdx = 0; u32I2SIdx < sizeof(g_apI2sModule) / sizeof(I2S_T *); u32I2SIdx++)
    {
        pI2SModule = (I2S_T *)GetI2SModuel(u32I2SIdx);

        /* Write 2 data to TX FIFO */
        I2S_WRITE_TX_FIFO(pI2SModule, 1);
        I2S_WRITE_TX_FIFO(pI2SModule, 2);

        CU_ASSERT(I2S_GET_TX_FIFO_LEVEL(pI2SModule) == 2);

        I2S_WRITE_TX_FIFO(pI2SModule, 3);

        CU_ASSERT(I2S_GET_TX_FIFO_LEVEL(pI2SModule) == 3);

        I2S_CLR_TX_FIFO(pI2SModule);
        CU_ASSERT(I2S_GET_TX_FIFO_LEVEL(pI2SModule) == 0);
    }
}

void MACRO_I2S_READ_RX_FIFO()
{
    uint32_t u32I2SIdx = 0;
    I2S_T *pI2SModule = NULL;

    for (u32I2SIdx = 0; u32I2SIdx < sizeof(g_apI2sModule) / sizeof(I2S_T *); u32I2SIdx++)
    {
        pI2SModule = (I2S_T *)GetI2SModuel(u32I2SIdx);

        /* Set I2S bit clock divider */
        pI2SModule->CLKDIV = 0x8000;
        /* Enable I2S RX function */
        pI2SModule->CTL0 = 5;

        while ((pI2SModule->STATUS1 & 0x000F0000) != 0x00030000);

        /* Disable I2S RX function */
        pI2SModule->CTL0 = 0;

        I2S_READ_RX_FIFO(pI2SModule);

        CU_ASSERT(I2S_GET_RX_FIFO_LEVEL(pI2SModule) == 2);

        I2S_READ_RX_FIFO(pI2SModule);

        CU_ASSERT(I2S_GET_RX_FIFO_LEVEL(pI2SModule) == 1);

        I2S_READ_RX_FIFO(pI2SModule);

        CU_ASSERT(I2S_GET_RX_FIFO_LEVEL(pI2SModule) == 0);
    }
}

void MACRO_I2S_GET_CLEAR_INT_FLAG()
{
    uint32_t u32I2SIdx = 0;
    I2S_T *pI2SModule = NULL;

    for (u32I2SIdx = 0; u32I2SIdx < sizeof(g_apI2sModule) / sizeof(I2S_T *); u32I2SIdx++)
    {
        pI2SModule = (I2S_T *)GetI2SModuel(u32I2SIdx);

        pI2SModule->TXFIFO = 0xA0A0A0A0;
        pI2SModule->TXFIFO = 0xA0A0A0A0;
        pI2SModule->TXFIFO = 0x50505050;
        pI2SModule->TXFIFO = 0x50505050;
        pI2SModule->TXFIFO = 0xA0A0A0A0;
        pI2SModule->TXFIFO = 0xA0A0A0A0;
        pI2SModule->TXFIFO = 0x50505050;
        pI2SModule->TXFIFO = 0x50505050;

        /* Channel-0 zero-cross flag test */
        /* Set I2S bit clock divider */
        pI2SModule->CLKDIV = 0x8000;
        /* Enable left channel zero-cross detection function, I2S RX function, I2S TX function and I2S controller. */
        pI2SModule->CTL1 = 0x00000001;
        pI2SModule->CTL0 = 0xC4000007;

        while (I2S_GET_RX_FIFO_LEVEL(pI2SModule) <= 8) {}

        CU_ASSERT((I2S_GET_ZC_INT_FLAG(pI2SModule, I2S_STATUS1_CH0ZCIF_Msk) & 0x00000001) == 0x00000001);

        I2S_CLR_ZC_INT_FLAG(pI2SModule, I2S_STATUS1_CH0ZCIF_Msk);

        CU_ASSERT(I2S_GET_ZC_INT_FLAG(pI2SModule, I2S_STATUS1_CH0ZCIF_Msk) == 0);
        pI2SModule->CTL0 = 0;

        /* Reset I2S */
        ResetI2SModule(u32I2SIdx);

        pI2SModule->TXFIFO = 0xA0A0A0A0;
        pI2SModule->TXFIFO = 0xA0A0A0A0;
        pI2SModule->TXFIFO = 0x50505050;
        pI2SModule->TXFIFO = 0x50505050;
        pI2SModule->TXFIFO = 0xA0A0A0A0;
        pI2SModule->TXFIFO = 0xA0A0A0A0;
        pI2SModule->TXFIFO = 0x50505050;
        pI2SModule->TXFIFO = 0x50505050;

        /* Channel-1 zero-cross flag test */
        /* Set I2S bit clock divider */
        pI2SModule->CLKDIV = 0x8000;
        /* Enable right channel zero-cross detection function, I2S RX function, I2S TX function and I2S controller. */
        pI2SModule->CTL1 = 0x00000002;
        pI2SModule->CTL0 = 0xC4000007;

        while (I2S_GET_RX_FIFO_LEVEL(pI2SModule) <= 8) {}

