wosayttn/M55M1BSP/_CUnit/i2s/i2s_cunit.c
        CU_ASSERT((I2S_GET_ZC_INT_FLAG(pI2SModule, I2S_STATUS1_CH1ZCIF_Msk) & 0x00000002) == 0x00000002);
        I2S_CLR_ZC_INT_FLAG(pI2SModule, I2S_STATUS1_CH1ZCIF_Msk);
        CU_ASSERT(I2S_GET_ZC_INT_FLAG(pI2SModule, I2S_STATUS1_CH1ZCIF_Msk) == 0);
        pI2SModule->CTL0 = 0;

        /* Reset I2S */
        ResetI2SModule(u32I2SIdx);

        pI2SModule->TXFIFO = 0xA0A0A0A0;
        pI2SModule->TXFIFO = 0xA0A0A0A0;
        pI2SModule->TXFIFO = 0x50505050;
        pI2SModule->TXFIFO = 0x50505050;
        pI2SModule->TXFIFO = 0xA0A0A0A0;
        pI2SModule->TXFIFO = 0xA0A0A0A0;
        pI2SModule->TXFIFO = 0x50505050;
        pI2SModule->TXFIFO = 0x50505050;

        /* Channel-2 zero-cross flag test */
        /* Set I2S bit clock divider */
        pI2SModule->CLKDIV = 0x8000;
        /* Enable right channel zero-cross detection function, I2S RX function, I2S TX function and I2S controller. */
        pI2SModule->CTL1 = 0x0000000F;
        pI2SModule->CTL0 = 0xC4000007;

        while (I2S_GET_RX_FIFO_LEVEL(pI2SModule) <= 8) {}

        CU_ASSERT((I2S_GET_ZC_INT_FLAG(pI2SModule, I2S_STATUS1_CH2ZCIF_Msk) & 0x00000004) == 0x00000004);
        I2S_CLR_ZC_INT_FLAG(pI2SModule, I2S_STATUS1_CH2ZCIF_Msk);
        CU_ASSERT(I2S_GET_ZC_INT_FLAG(pI2SModule, I2S_STATUS1_CH2ZCIF_Msk) == 0);
        pI2SModule->CTL0 = 0;

        /* Reset I2S */
        ResetI2SModule(u32I2SIdx);

        pI2SModule->TXFIFO = 0xA0A0A0A0;
        pI2SModule->TXFIFO = 0xA0A0A0A0;
        pI2SModule->TXFIFO = 0x50505050;
        pI2SModule->TXFIFO = 0x50505050;
        pI2SModule->TXFIFO = 0xA0A0A0A0;
        pI2SModule->TXFIFO = 0xA0A0A0A0;
        pI2SModule->TXFIFO = 0x50505050;
        pI2SModule->TXFIFO = 0x50505050;

        /* Channel-3 zero-cross flag test */
        /* Set I2S bit clock divider */
        pI2SModule->CLKDIV = 0x8000;
        /* Enable right channel zero-cross detection function, I2S RX function, I2S TX function and I2S controller. */
        pI2SModule->CTL1 = 0x00000008;
        pI2SModule->CTL0 = 0xC4000007;

        while (I2S_GET_RX_FIFO_LEVEL(pI2SModule) <= 14) {}

        CU_ASSERT((I2S_GET_ZC_INT_FLAG(pI2SModule, I2S_STATUS1_CH3ZCIF_Msk) & 0x00000008) == 0x00000008);
        I2S_CLR_ZC_INT_FLAG(pI2SModule, I2S_STATUS1_CH3ZCIF_Msk);
        CU_ASSERT(I2S_GET_ZC_INT_FLAG(pI2SModule, I2S_STATUS1_CH3ZCIF_Msk) == 0);
        pI2SModule->CTL0 = 0;

        /* Reset I2S */
        ResetI2SModule(u32I2SIdx);

        pI2SModule->TXFIFO = 0xA0A0A0A0;
        pI2SModule->TXFIFO = 0x50505050;
        pI2SModule->TXFIFO = 0xA0A0A0A0;
        pI2SModule->TXFIFO = 0x50505050;
        pI2SModule->TXFIFO = 0xA0A0A0A0;
        pI2SModule->TXFIFO = 0x50505050;
        pI2SModule->TXFIFO = 0xA0A0A0A0;
        pI2SModule->TXFIFO = 0x50505050;

        /* Channel-4 zero-cross flag test */
        /* Set I2S bit clock divider */
        pI2SModule->CLKDIV = 0x1000;
        /* Enable right channel zero-cross detection function, I2S RX function, I2S TX function and I2S controller. */
        pI2SModule->CTL1 = 0x00000010;
        pI2SModule->CTL0 = 0xC4000007;

        while (I2S_GET_RX_FIFO_LEVEL(pI2SModule) <= 14) {}

        CU_ASSERT((I2S_GET_ZC_INT_FLAG(pI2SModule, I2S_STATUS1_CH4ZCIF_Msk) & 0x00000010) == 0x00000010);
        I2S_CLR_ZC_INT_FLAG(pI2SModule, I2S_STATUS1_CH4ZCIF_Msk);
        CU_ASSERT(I2S_GET_ZC_INT_FLAG(pI2SModule, I2S_STATUS1_CH4ZCIF_Msk) == 0);
        pI2SModule->CTL0 = 0;

        /* Reset I2S */
        ResetI2SModule(u32I2SIdx);

        pI2SModule->TXFIFO = 0xA0A0A0A0;
        pI2SModule->TXFIFO = 0x50505050;
        pI2SModule->TXFIFO = 0xA0A0A0A0;
        pI2SModule->TXFIFO = 0x50505050;
        pI2SModule->TXFIFO = 0xA0A0A0A0;
        pI2SModule->TXFIFO = 0x50505050;
        pI2SModule->TXFIFO = 0xA0A0A0A0;
        pI2SModule->TXFIFO = 0x50505050;

        /* Channel-5 zero-cross flag test */
        /* Set I2S bit clock divider */
        pI2SModule->CLKDIV = 0x8000;
        /* Enable right channel zero-cross detection function, I2S RX function, I2S TX function and I2S controller. */
        pI2SModule->CTL1 = 0x00000020;
        pI2SModule->CTL0 = 0xC4000007;

        while (I2S_GET_RX_FIFO_LEVEL(pI2SModule) <= 14) {}

        CU_ASSERT((I2S_GET_ZC_INT_FLAG(pI2SModule, I2S_STATUS1_CH5ZCIF_Msk) & 0x00000020) == 0x00000020);
        I2S_CLR_ZC_INT_FLAG(pI2SModule, I2S_STATUS1_CH5ZCIF_Msk);
        CU_ASSERT(I2S_GET_ZC_INT_FLAG(pI2SModule, I2S_STATUS1_CH5ZCIF_Msk) == 0);
        pI2SModule->CTL0 = 0;

        /* Reset I2S */
        ResetI2SModule(u32I2SIdx);

        pI2SModule->TXFIFO = 0xA0A0A0A0;
        pI2SModule->TXFIFO = 0xA0A0A0A0;
        pI2SModule->TXFIFO = 0xA0A0A0A0;
        pI2SModule->TXFIFO = 0xA0A0A0A0;
        pI2SModule->TXFIFO = 0x50505050;
        pI2SModule->TXFIFO = 0x50505050;
        pI2SModule->TXFIFO = 0x50505050;
        pI2SModule->TXFIFO = 0x50505050;

        /* Channel-6 zero-cross flag test */
        /* Set I2S bit clock divider */
        pI2SModule->CLKDIV = 0x8000;
        /* Enable right channel zero-cross detection function, I2S RX function, I2S TX function and I2S controller. */
        pI2SModule->CTL1 = 0x00000040;
        pI2SModule->CTL0 |= 0xC4000007;

        while (I2S_GET_RX_FIFO_LEVEL(pI2SModule) <= 14) {}

        CU_ASSERT((I2S_GET_ZC_INT_FLAG(pI2SModule, I2S_STATUS1_CH6ZCIF_Msk) & 0x00000040) == 0x00000040);
        I2S_CLR_ZC_INT_FLAG(pI2SModule, I2S_STATUS1_CH6ZCIF_Msk);
        CU_ASSERT(I2S_GET_ZC_INT_FLAG(pI2SModule, I2S_STATUS1_CH6ZCIF_Msk) == 0);
        pI2SModule->CTL0 = 0;

        /* Reset I2S */
        ResetI2SModule(u32I2SIdx);

        pI2SModule->TXFIFO = 0xA0A0A0A0;
        pI2SModule->TXFIFO = 0xA0A0A0A0;
        pI2SModule->TXFIFO = 0xA0A0A0A0;
        pI2SModule->TXFIFO = 0xA0A0A0A0;
        pI2SModule->TXFIFO = 0x50505050;
        pI2SModule->TXFIFO = 0x50505050;
        pI2SModule->TXFIFO = 0x50505050;
        pI2SModule->TXFIFO = 0x50505050;

        /* Channel-7 zero-cross flag test */
        /* Set I2S bit clock divider */
        pI2SModule->CLKDIV = 0x8000;
        /* Enable right channel zero-cross detection function, I2S RX function, I2S TX function and I2S controller. */
        pI2SModule->CTL1 = 0x00000080;
        pI2SModule->CTL0 = 0xC4000007;

        while (I2S_GET_RX_FIFO_LEVEL(pI2SModule) <= 14) {}

        CU_ASSERT((I2S_GET_ZC_INT_FLAG(pI2SModule, I2S_STATUS1_CH7ZCIF_Msk) & 0x00000080) == 0x00000080);
        I2S_CLR_ZC_INT_FLAG(pI2SModule, I2S_STATUS1_CH7ZCIF_Msk);
        CU_ASSERT(I2S_GET_ZC_INT_FLAG(pI2SModule, I2S_STATUS1_CH7ZCIF_Msk) == 0);
        pI2SModule->CTL0 = 0;

        /* Reset I2S */
        ResetI2SModule(u32I2SIdx);

        /* TX threshold interrupt flag test */
        /* Set I2S bit clock divider */
        pI2SModule->CLKDIV = 0x0800;
        /* Enable I2S controller and TX function; set TX threshold as 2. */
        pI2SModule->CTL0 = 0x3;
        pI2SModule->CTL1 = 0x200;

        CU_ASSERT(I2S_GET_INT_FLAG(pI2SModule, I2S_STATUS0_TXTHIF_Msk | I2S_STATUS0_I2STXINT_Msk | I2S_STATUS0_I2SINT_Msk) == 0x00040000);
        /* Enable TX threshold interrupt function */
        pI2SModule->IEN |= 0x400;

        CU_ASSERT(I2S_GET_INT_FLAG(pI2SModule, I2S_STATUS0_TXTHIF_Msk | I2S_STATUS0_I2STXINT_Msk | I2S_STATUS0_I2SINT_Msk) == 0x00040005);

