wosayttn/M55M1BSP/_CUnit/i2s/i2s_cunit.c
        /* Write 3 data to TX FIFO */
        I2S_WRITE_TX_FIFO(pI2SModule, 1);
        I2S_WRITE_TX_FIFO(pI2SModule, 2);
        I2S_WRITE_TX_FIFO(pI2SModule, 3);

        CU_ASSERT(I2S_GET_INT_FLAG(pI2SModule, I2S_STATUS0_TXTHIF_Msk | I2S_STATUS0_I2STXINT_Msk | I2S_STATUS0_I2SINT_Msk) == 0);

        /* Reset I2S */
        ResetI2SModule(u32I2SIdx);

        /* TX overflow interrupt flag test */
        /* Set I2S bit clock divider */
        pI2SModule->CLKDIV = 0x8000;
        /* Enable I2S controller */
        pI2SModule->CTL0 = 1;

        /* Write 9 data to TX FIFO */
        I2S_WRITE_TX_FIFO(pI2SModule, 1);
        I2S_WRITE_TX_FIFO(pI2SModule, 2);
        I2S_WRITE_TX_FIFO(pI2SModule, 3);
        I2S_WRITE_TX_FIFO(pI2SModule, 4);
        I2S_WRITE_TX_FIFO(pI2SModule, 5);
        I2S_WRITE_TX_FIFO(pI2SModule, 6);
        I2S_WRITE_TX_FIFO(pI2SModule, 7);
        I2S_WRITE_TX_FIFO(pI2SModule, 8);
        I2S_WRITE_TX_FIFO(pI2SModule, 9);
        I2S_WRITE_TX_FIFO(pI2SModule, 10);
        I2S_WRITE_TX_FIFO(pI2SModule, 11);
        I2S_WRITE_TX_FIFO(pI2SModule, 12);
        I2S_WRITE_TX_FIFO(pI2SModule, 13);
        I2S_WRITE_TX_FIFO(pI2SModule, 14);
        I2S_WRITE_TX_FIFO(pI2SModule, 15);
        I2S_WRITE_TX_FIFO(pI2SModule, 16);
        I2S_WRITE_TX_FIFO(pI2SModule, 17);
        I2S_WRITE_TX_FIFO(pI2SModule, 18);
        I2S_WRITE_TX_FIFO(pI2SModule, 19);

        CU_ASSERT(I2S_GET_INT_FLAG(pI2SModule, I2S_STATUS0_TXOVIF_Msk) == 0x00020000);

        I2S_CLR_INT_FLAG(pI2SModule, I2S_STATUS0_TXOVIF_Msk);

        CU_ASSERT(I2S_GET_INT_FLAG(pI2SModule, I2S_STATUS0_TXOVIF_Msk) == 0);

        /* Reset I2S */
        ResetI2SModule(u32I2SIdx);

        /* TX underflow interrupt flag test */
        /* Set I2S bit clock divider */
        pI2SModule->CLKDIV = 0x8000;
        /* Enable I2S RX function, I2S TX function and I2S controller. */
        pI2SModule->CTL0 = 0x00000007;

        while (I2S_GET_RX_FIFO_LEVEL(pI2SModule) <= 2);

        pI2SModule->CTL0 = 0;

        CU_ASSERT(I2S_GET_INT_FLAG(pI2SModule, I2S_STATUS0_TXUDIF_Msk) == 0x00010000);

        I2S_CLR_INT_FLAG(pI2SModule, I2S_STATUS0_TXUDIF_Msk);

        CU_ASSERT(I2S_GET_INT_FLAG(pI2SModule, I2S_STATUS0_TXUDIF_Msk) == 0);

        /* Reset I2S */
        ResetI2SModule(u32I2SIdx);

        /* RX threshold interrupt flag test */
        /* Set I2S bit clock divider */
        pI2SModule->CLKDIV = 0xFF00;
        /* Set RX threshold as 2; enable I2S RX function and I2S controller. */
        pI2SModule->CTL1 = 0x00020000;
        pI2SModule->CTL0 = 0x00000005;

        while (I2S_GET_RX_FIFO_LEVEL(pI2SModule) <= 2) {}

        //pI2SModule->CTL = 0;

        CU_ASSERT(I2S_GET_INT_FLAG(pI2SModule, I2S_STATUS0_RXTHIF_Msk | I2S_STATUS0_I2SRXINT_Msk | I2S_STATUS0_I2SINT_Msk) == 0x00000400);

        /* Enable RX threshold interrupt function */
        pI2SModule->IEN |= 0x4;

        CU_ASSERT(I2S_GET_INT_FLAG(pI2SModule, I2S_STATUS0_RXTHIF_Msk | I2S_STATUS0_I2SRXINT_Msk | I2S_STATUS0_I2SINT_Msk) == 0x00000403);
        pI2SModule->CTL0 = 1;
        I2S_READ_RX_FIFO(pI2SModule);
        I2S_READ_RX_FIFO(pI2SModule);
        I2S_READ_RX_FIFO(pI2SModule);
        I2S_READ_RX_FIFO(pI2SModule);
        I2S_READ_RX_FIFO(pI2SModule);
        I2S_READ_RX_FIFO(pI2SModule);
        I2S_READ_RX_FIFO(pI2SModule);

        CU_ASSERT(I2S_GET_INT_FLAG(pI2SModule, I2S_STATUS0_RXTHIF_Msk | I2S_STATUS0_I2SRXINT_Msk | I2S_STATUS0_I2SINT_Msk) == 0);

        /* Reset I2S */
        ResetI2SModule(u32I2SIdx);

        /* RX overflow interrupt flag test */
        /* Set I2S bit clock divider */
        pI2SModule->CLKDIV = 0x8000;
        /* Enable I2S RX function, I2S TX function and I2S controller. */
        pI2SModule->CTL0 = 0x00000007;

        while (I2S_GET_RX_FIFO_LEVEL(pI2SModule) != 8);

        /* Write 3 data to TX FIFO */
        I2S_WRITE_TX_FIFO(pI2SModule, 1);
        I2S_WRITE_TX_FIFO(pI2SModule, 2);
        I2S_WRITE_TX_FIFO(pI2SModule, 3);
        I2S_WRITE_TX_FIFO(pI2SModule, 4);
        I2S_WRITE_TX_FIFO(pI2SModule, 5);
        I2S_WRITE_TX_FIFO(pI2SModule, 6);
        I2S_WRITE_TX_FIFO(pI2SModule, 7);
        I2S_WRITE_TX_FIFO(pI2SModule, 8);
        I2S_WRITE_TX_FIFO(pI2SModule, 9);
        I2S_WRITE_TX_FIFO(pI2SModule, 10);
        I2S_WRITE_TX_FIFO(pI2SModule, 11);
        I2S_WRITE_TX_FIFO(pI2SModule, 12);
        I2S_WRITE_TX_FIFO(pI2SModule, 13);
        I2S_WRITE_TX_FIFO(pI2SModule, 14);
        I2S_WRITE_TX_FIFO(pI2SModule, 15);

        while (I2S_GET_TX_FIFO_LEVEL(pI2SModule) != 0) {}

        CU_ASSERT(I2S_GET_INT_FLAG(pI2SModule, I2S_STATUS0_RXOVIF_Msk) == 0x00000200);
        I2S_CLR_INT_FLAG(pI2SModule, I2S_STATUS0_RXOVIF_Msk);
        CU_ASSERT(I2S_GET_INT_FLAG(pI2SModule, I2S_STATUS0_RXOVIF_Msk) == 0);
        pI2SModule->CTL0 = 0;

        /* Reset I2S */
        ResetI2SModule(u32I2SIdx);

        /* RX underflow interrupt flag test */
        /* Enable I2S controller */
        pI2SModule->CTL0 = 1;

        I2S_READ_RX_FIFO(pI2SModule);
        I2S_READ_RX_FIFO(pI2SModule);

        CU_ASSERT(I2S_GET_INT_FLAG(pI2SModule, I2S_STATUS0_RXUDIF_Msk) == 0x00000100);

        I2S_CLR_INT_FLAG(pI2SModule, I2S_STATUS0_RXUDIF_Msk);

        CU_ASSERT(I2S_GET_INT_FLAG(pI2SModule, I2S_STATUS0_RXUDIF_Msk) == 0);

        /* Reset I2S */
        ResetI2SModule(u32I2SIdx);
    }
}

void MACRO_I2S_GET_TX_FIFO_LEVEL()
{
    uint32_t u32I2SIdx = 0;
    I2S_T *pI2SModule = NULL;

    for (u32I2SIdx = 0; u32I2SIdx < sizeof(g_apI2sModule) / sizeof(I2S_T *); u32I2SIdx++)
    {
        pI2SModule = (I2S_T *)GetI2SModuel(u32I2SIdx);

        /* Write data to TX FIFO */
        I2S_WRITE_TX_FIFO(pI2SModule, 1);

        CU_ASSERT(I2S_GET_TX_FIFO_LEVEL(pI2SModule) == 1);

        I2S_WRITE_TX_FIFO(pI2SModule, 2);

        CU_ASSERT(I2S_GET_TX_FIFO_LEVEL(pI2SModule) == 2);

        I2S_WRITE_TX_FIFO(pI2SModule, 3);

        CU_ASSERT(I2S_GET_TX_FIFO_LEVEL(pI2SModule) == 3);

        I2S_WRITE_TX_FIFO(pI2SModule, 4);

        CU_ASSERT(I2S_GET_TX_FIFO_LEVEL(pI2SModule) == 4);

        I2S_WRITE_TX_FIFO(pI2SModule, 5);

        CU_ASSERT(I2S_GET_TX_FIFO_LEVEL(pI2SModule) == 5);

        I2S_WRITE_TX_FIFO(pI2SModule, 6);

        CU_ASSERT(I2S_GET_TX_FIFO_LEVEL(pI2SModule) == 6);

