wosayttn/M55M1BSP/_CUnit/i2s/i2s_cunit.c
        I2S_WRITE_TX_FIFO(pI2SModule, 7);

        CU_ASSERT(I2S_GET_TX_FIFO_LEVEL(pI2SModule) == 7);

        I2S_WRITE_TX_FIFO(pI2SModule, 8);

        CU_ASSERT(I2S_GET_TX_FIFO_LEVEL(pI2SModule) == 8);

        /* Reset I2S */
        ResetI2SModule(u32I2SIdx);
    }
}

void MACRO_I2S_GET_RX_FIFO_LEVEL()
{
    uint32_t u32I2SIdx = 0;
    I2S_T *pI2SModule = NULL;

    for (u32I2SIdx = 0; u32I2SIdx < sizeof(g_apI2sModule) / sizeof(I2S_T *); u32I2SIdx++)
    {
        pI2SModule = (I2S_T *)GetI2SModuel(u32I2SIdx);

        /* Set I2S bit clock divider */
        pI2SModule->CLKDIV = 0xFF00;
        /* Enable I2S RX function */
        pI2SModule->CTL0 = 5;

        while ((pI2SModule->STATUS1 & 0x000F0000) != 0x00010000) __NOP();

        CU_ASSERT(I2S_GET_RX_FIFO_LEVEL(pI2SModule) == 1);

        while ((pI2SModule->STATUS1 & 0x000F0000) != 0x00020000) __NOP();

        CU_ASSERT(I2S_GET_RX_FIFO_LEVEL(pI2SModule) == 2);

        while ((pI2SModule->STATUS1 & 0x000F0000) != 0x00030000) __NOP();

        CU_ASSERT(I2S_GET_RX_FIFO_LEVEL(pI2SModule) == 3);

        while ((pI2SModule->STATUS1 & 0x000F0000) != 0x00040000) __NOP();

        CU_ASSERT(I2S_GET_RX_FIFO_LEVEL(pI2SModule) == 4);

        while ((pI2SModule->STATUS1 & 0x000F0000) != 0x00050000) __NOP();

        CU_ASSERT(I2S_GET_RX_FIFO_LEVEL(pI2SModule) == 5);

        while ((pI2SModule->STATUS1 & 0x000F0000) != 0x00060000) __NOP();

        CU_ASSERT(I2S_GET_RX_FIFO_LEVEL(pI2SModule) == 6);

        while ((pI2SModule->STATUS1 & 0x000F0000) != 0x00070000) __NOP();

        CU_ASSERT(I2S_GET_RX_FIFO_LEVEL(pI2SModule) == 7);

        while ((pI2SModule->STATUS1 & 0x000F0000) != 0x00080000) __NOP();

        CU_ASSERT(I2S_GET_RX_FIFO_LEVEL(pI2SModule) == 8);

        /* Disable I2S RX function */
        pI2SModule->CTL0 = 0;

        /* Reset I2S */
        ResetI2SModule(u32I2SIdx);
    }
}

void API_I2S_Open()
{
    uint32_t u32ReturnValue;
    uint32_t u32I2SIdx = 0;
    I2S_T *pI2SModule = NULL;

    for (u32I2SIdx = 0; u32I2SIdx < sizeof(g_apI2sModule) / sizeof(I2S_T *); u32I2SIdx++)
    {
        pI2SModule = (I2S_T *)GetI2SModuel(u32I2SIdx);

        if (u32I2SIdx == C_I2S0)
        {
            CLK->I2SSEL = (CLK->I2SSEL & ~CLK_I2SSEL_I2S0SEL_Msk) | CLK_I2SSEL_I2S0SEL_HIRC;
        }
        else if (u32I2SIdx == C_I2S1)
        {
            CLK->I2SSEL = (CLK->I2SSEL & ~CLK_I2SSEL_I2S1SEL_Msk) | CLK_I2SSEL_I2S0SEL_HIRC;
        }

        u32ReturnValue = I2S_Open(pI2SModule, I2S_MODE_MASTER, 8000, I2S_DATABIT_8, I2S_ENABLE_MONO, I2S_FORMAT_I2S);
        CU_ASSERT(pI2SModule->CTL0 == 0x00000041);
        CU_ASSERT(pI2SModule->CLKDIV == 0x00002D00);
        CU_ASSERT(u32ReturnValue == 8152);

        /* Reset I2S */
        ResetI2SModule(u32I2SIdx);

        u32ReturnValue = I2S_Open(pI2SModule, I2S_MODE_SLAVE, 8000, I2S_DATABIT_16, I2S_DISABLE_MONO, I2S_FORMAT_I2S_MSB);
        CU_ASSERT(pI2SModule->CTL0 == 0x01000111);
        CU_ASSERT(pI2SModule->CLKDIV == 0x00001600);
        CU_ASSERT(u32ReturnValue == 8152);

        /* Reset I2S */
        ResetI2SModule(u32I2SIdx);

        u32ReturnValue = I2S_Open(pI2SModule, I2S_MODE_SLAVE, 8000, I2S_DATABIT_16, I2S_DISABLE_MONO, I2S_FORMAT_I2S_LSB);
        CU_ASSERT(pI2SModule->CTL0 == 0x02000111);
        CU_ASSERT(pI2SModule->CLKDIV == 0x00001600);
        CU_ASSERT(u32ReturnValue == 8152);

        /* Reset I2S */
        ResetI2SModule(u32I2SIdx);

        u32ReturnValue = I2S_Open(pI2SModule, I2S_MODE_SLAVE, 16000, I2S_DATABIT_24, I2S_DISABLE_MONO, I2S_FORMAT_PCM);
        CU_ASSERT(pI2SModule->CTL0 == 0x04000121);
        CU_ASSERT(pI2SModule->CLKDIV == 0x0000600);
        CU_ASSERT(u32ReturnValue == 17857);

        /* Reset I2S */
        ResetI2SModule(u32I2SIdx);

        u32ReturnValue = I2S_Open(pI2SModule, I2S_MODE_SLAVE, 32000, I2S_DATABIT_32, I2S_DISABLE_MONO, I2S_FORMAT_PCM_MSB);
        CU_ASSERT(pI2SModule->CTL0 == 0x05000131);
        CU_ASSERT(pI2SModule->CLKDIV == 0x00000100);
        CU_ASSERT(u32ReturnValue == 46875);

        /* Reset I2S */
        ResetI2SModule(u32I2SIdx);

        u32ReturnValue = I2S_Open(pI2SModule, I2S_MODE_SLAVE, 32000, I2S_DATABIT_32, I2S_DISABLE_MONO, I2S_FORMAT_PCM_LSB);
        CU_ASSERT(pI2SModule->CTL0 == 0x06000131);
        CU_ASSERT(pI2SModule->CLKDIV == 0x00000100);
        CU_ASSERT(u32ReturnValue == 46875);

        /* Reset I2S */
        ResetI2SModule(u32I2SIdx);
    }
}

void API_I2S_Close()
{
    uint32_t u32I2SIdx = 0;
    I2S_T *pI2SModule = NULL;

    for (u32I2SIdx = 0; u32I2SIdx < sizeof(g_apI2sModule) / sizeof(I2S_T *); u32I2SIdx++)
    {
        pI2SModule = (I2S_T *)GetI2SModuel(u32I2SIdx);

        pI2SModule->CTL0 = 1;

        I2S_Close(pI2SModule);

        CU_ASSERT_FALSE(pI2SModule->CTL0 & 1);
    }
}

void API_I2S_EnableInt_DisableInt()
{
    uint32_t u32I2SIdx = 0;
    I2S_T *pI2SModule = NULL;

    for (u32I2SIdx = 0; u32I2SIdx < sizeof(g_apI2sModule) / sizeof(I2S_T *); u32I2SIdx++)
    {
        pI2SModule = (I2S_T *)GetI2SModuel(u32I2SIdx);

        I2S_EnableInt(pI2SModule, I2S_IEN_CH0ZCIEN_Msk);
        CU_ASSERT(pI2SModule->IEN == 0x10000);
        I2S_DisableInt(pI2SModule, I2S_IEN_CH0ZCIEN_Msk);
        CU_ASSERT(pI2SModule->IEN == 0);

        I2S_EnableInt(pI2SModule, I2S_IEN_CH1ZCIEN_Msk);
        CU_ASSERT(pI2SModule->IEN == 0x20000);
        I2S_DisableInt(pI2SModule, I2S_IEN_CH1ZCIEN_Msk);
        CU_ASSERT(pI2SModule->IEN == 0);

        I2S_EnableInt(pI2SModule, I2S_IEN_CH2ZCIEN_Msk);
        CU_ASSERT(pI2SModule->IEN == 0x40000);
        I2S_DisableInt(pI2SModule, I2S_IEN_CH2ZCIEN_Msk);
        CU_ASSERT(pI2SModule->IEN == 0);

        I2S_EnableInt(pI2SModule, I2S_IEN_CH3ZCIEN_Msk);
        CU_ASSERT(pI2SModule->IEN == 0x80000);
        I2S_DisableInt(pI2SModule, I2S_IEN_CH3ZCIEN_Msk);
        CU_ASSERT(pI2SModule->IEN == 0);

        I2S_EnableInt(pI2SModule, I2S_IEN_CH4ZCIEN_Msk);
        CU_ASSERT(pI2SModule->IEN == 0x100000);
        I2S_DisableInt(pI2SModule, I2S_IEN_CH4ZCIEN_Msk);
        CU_ASSERT(pI2SModule->IEN == 0);

        I2S_EnableInt(pI2SModule, I2S_IEN_CH5ZCIEN_Msk);
        CU_ASSERT(pI2SModule->IEN == 0x200000);
        I2S_DisableInt(pI2SModule, I2S_IEN_CH5ZCIEN_Msk);
        CU_ASSERT(pI2SModule->IEN == 0);

        I2S_EnableInt(pI2SModule, I2S_IEN_CH6ZCIEN_Msk);
        CU_ASSERT(pI2SModule->IEN == 0x400000);
        I2S_DisableInt(pI2SModule, I2S_IEN_CH6ZCIEN_Msk);
        CU_ASSERT(pI2SModule->IEN == 0);

        I2S_EnableInt(pI2SModule, I2S_IEN_CH7ZCIEN_Msk);
        CU_ASSERT(pI2SModule->IEN == 0x800000);
        I2S_DisableInt(pI2SModule, I2S_IEN_CH7ZCIEN_Msk);
        CU_ASSERT(pI2SModule->IEN == 0);

