wosayttn/M55M1BSP/_CUnit/i2s/i2s_cunit.c
        I2S_EnableInt(pI2SModule, I2S_IEN_TXTHIEN_Msk);
        CU_ASSERT(pI2SModule->IEN == 0x0400);
        I2S_DisableInt(pI2SModule, I2S_IEN_TXTHIEN_Msk);
        CU_ASSERT(pI2SModule->IEN == 0);

        I2S_EnableInt(pI2SModule, I2S_IEN_TXOVFIEN_Msk);
        CU_ASSERT(pI2SModule->IEN == 0x0200);
        I2S_DisableInt(pI2SModule, I2S_IEN_TXOVFIEN_Msk);
        CU_ASSERT(pI2SModule->IEN == 0);

        I2S_EnableInt(pI2SModule, I2S_IEN_TXUDFIEN_Msk);
        CU_ASSERT(pI2SModule->IEN == 0x0100);
        I2S_DisableInt(pI2SModule, I2S_IEN_TXUDFIEN_Msk);
        CU_ASSERT(pI2SModule->IEN == 0);

        I2S_EnableInt(pI2SModule, I2S_IEN_RXTHIEN_Msk);
        CU_ASSERT(pI2SModule->IEN == 0x0004);
        I2S_DisableInt(pI2SModule, I2S_IEN_RXTHIEN_Msk);
        CU_ASSERT(pI2SModule->IEN == 0);

        I2S_EnableInt(pI2SModule, I2S_IEN_RXOVFIEN_Msk);
        CU_ASSERT(pI2SModule->IEN == 0x0002);
        I2S_DisableInt(pI2SModule, I2S_IEN_RXOVFIEN_Msk);
        CU_ASSERT(pI2SModule->IEN == 0);

        I2S_EnableInt(pI2SModule, I2S_IEN_RXUDFIEN_Msk);
        CU_ASSERT(pI2SModule->IEN == 0x0001);
        I2S_DisableInt(pI2SModule, I2S_IEN_RXUDFIEN_Msk);
        CU_ASSERT(pI2SModule->IEN == 0);

        /* Reset I2S */
        ResetI2SModule(u32I2SIdx);
    }
}

void API_I2S_EnableMCLK()
{
    uint32_t u32ReturnValue;
    uint32_t u32I2SIdx = 0;
    I2S_T *pI2SModule = NULL;

    for (u32I2SIdx = 0; u32I2SIdx < sizeof(g_apI2sModule) / sizeof(I2S_T *); u32I2SIdx++)
    {
        pI2SModule = (I2S_T *)GetI2SModuel(u32I2SIdx);

        if (u32I2SIdx == C_I2S0)
        {
            CLK->I2SSEL = (CLK->I2SSEL & ~CLK_I2SSEL_I2S0SEL_Msk) | CLK_I2SSEL_I2S0SEL_HIRC;
        }
        else if (u32I2SIdx == C_I2S1)
        {
            CLK->I2SSEL = (CLK->I2SSEL & ~CLK_I2SSEL_I2S1SEL_Msk) | CLK_I2SSEL_I2S1SEL_HIRC;
        }

        u32ReturnValue = I2S_EnableMCLK(pI2SModule, 2048000);
        CU_ASSERT(pI2SModule->CTL0 == 0x00008000);
        CU_ASSERT(pI2SModule->CLKDIV == 0x00000002);
        CU_ASSERT(u32ReturnValue == 3000000);

        /* Reset I2S */
        ResetI2SModule(u32I2SIdx);

        u32ReturnValue = I2S_EnableMCLK(pI2SModule, 12000000);
        CU_ASSERT(pI2SModule->CTL0 == 0x00008000);
        CU_ASSERT(pI2SModule->CLKDIV == 0x00000000);
        CU_ASSERT(u32ReturnValue == 12000000);

        /* Reset I2S */
        ResetI2SModule(u32I2SIdx);

        if (u32I2SIdx == C_I2S0)
        {
            CLK->I2SSEL = (CLK->I2SSEL & ~CLK_I2SSEL_I2S0SEL_Msk) | CLK_I2SSEL_I2S0SEL_HXT;
        }
        else if (u32I2SIdx == C_I2S1)
        {
            CLK->I2SSEL = (CLK->I2SSEL & ~CLK_I2SSEL_I2S1SEL_Msk) | CLK_I2SSEL_I2S1SEL_HXT;
        }

        u32ReturnValue = I2S_EnableMCLK(pI2SModule, 12000000);
        CU_ASSERT(pI2SModule->CTL0 == 0x00008000);
        CU_ASSERT(pI2SModule->CLKDIV == 0x00000000);
        CU_ASSERT(u32ReturnValue == 12000000);

        /* Reset I2S */
        ResetI2SModule(u32I2SIdx);

        if (u32I2SIdx == C_I2S0)
        {
            CLK->I2SSEL = (CLK->I2SSEL & ~CLK_I2SSEL_I2S0SEL_Msk) | CLK_I2SSEL_I2S0SEL_APLL1_DIV2;
        }
        else if (u32I2SIdx == C_I2S1)
        {
            CLK->I2SSEL = (CLK->I2SSEL & ~CLK_I2SSEL_I2S1SEL_Msk) | CLK_I2SSEL_I2S0SEL_APLL1_DIV2;
        }

        u32ReturnValue = I2S_EnableMCLK(pI2SModule, 12000000);
        CU_ASSERT(pI2SModule->CTL0 == 0x00008000);
        CU_ASSERT(pI2SModule->CLKDIV == 0x00000000);
        CU_ASSERT(u32ReturnValue == 0);

        /* Reset I2S */
        ResetI2SModule(u32I2SIdx);

        if (u32I2SIdx == C_I2S0)
        {
            CLK->I2SSEL = (CLK->I2SSEL & ~CLK_I2SSEL_I2S0SEL_Msk) | CLK_I2SSEL_I2S0SEL_APLL0_DIV2;
        }
        else if (u32I2SIdx == C_I2S1)
        {
            CLK->I2SSEL = (CLK->I2SSEL & ~CLK_I2SSEL_I2S1SEL_Msk) | CLK_I2SSEL_I2S0SEL_APLL0_DIV2;
        }

        u32ReturnValue = I2S_EnableMCLK(pI2SModule, 12000000);
        CU_ASSERT(pI2SModule->CTL0 == 0x00008000);
        CU_ASSERT(pI2SModule->CLKDIV == 0x00000000);
        CU_ASSERT(u32ReturnValue == 0);

        /* Reset I2S */
        ResetI2SModule(u32I2SIdx);

        if (u32I2SIdx == C_I2S0)
        {
            CLK->I2SSEL = (CLK->I2SSEL & ~CLK_I2SSEL_I2S0SEL_Msk) | CLK_I2SSEL_I2S0SEL_PCLK1;
        }
        else if (u32I2SIdx == C_I2S1)
        {
            CLK->I2SSEL = (CLK->I2SSEL & ~CLK_I2SSEL_I2S1SEL_Msk) | CLK_I2SSEL_I2S0SEL_PCLK1;
        }

        u32ReturnValue = I2S_EnableMCLK(pI2SModule, 12000000);
        CU_ASSERT(pI2SModule->CTL0 == 0x00008000);
        CU_ASSERT(pI2SModule->CLKDIV == 0x00000000);
        CU_ASSERT(u32ReturnValue == 0);

        /* Reset I2S */
        ResetI2SModule(u32I2SIdx);

        if (u32I2SIdx == C_I2S0)
        {
            CLK->I2SSEL = (CLK->I2SSEL & ~CLK_I2SSEL_I2S0SEL_Msk) | CLK_I2SSEL_I2S0SEL_HIRC48M;
        }
        else if (u32I2SIdx == C_I2S1)
        {
            CLK->I2SSEL = (CLK->I2SSEL & ~CLK_I2SSEL_I2S1SEL_Msk) | CLK_I2SSEL_I2S0SEL_HIRC48M;
        }

        u32ReturnValue = I2S_EnableMCLK(pI2SModule, 12000000);
        CU_ASSERT(pI2SModule->CTL0 == 0x00008000);
        CU_ASSERT(pI2SModule->CLKDIV == 0x00000000);
        CU_ASSERT(u32ReturnValue == 0);
    }
}

void API_I2S_DisableMCLK()
{
    uint32_t u32I2SIdx = 0;
    I2S_T *pI2SModule = NULL;

    for (u32I2SIdx = 0; u32I2SIdx < sizeof(g_apI2sModule) / sizeof(I2S_T *); u32I2SIdx++)
    {
        pI2SModule = (I2S_T *)GetI2SModuel(u32I2SIdx);

        /* Set MCLKEN bit to 1 */
        pI2SModule->CTL0 = 0x8000;
        I2S_DisableMCLK(pI2SModule);

        /* Check MCLKEN bit */
        CU_ASSERT_FALSE(pI2SModule->CTL0 & 0x8000);
    }
}

void API_I2S_SetFIFO()
{
    uint32_t u32I2SIdx = 0;
    I2S_T *pI2SModule = NULL;

    for (u32I2SIdx = 0; u32I2SIdx < sizeof(g_apI2sModule) / sizeof(I2S_T *); u32I2SIdx++)
    {
        pI2SModule = (I2S_T *)GetI2SModuel(u32I2SIdx);

        I2S_SetFIFO(pI2SModule, 0, 0);
        CU_ASSERT((pI2SModule->CTL1 & 0x000F0F00) == (I2S_FIFO_TX_LEVEL_WORD_0 | I2S_FIFO_RX_LEVEL_WORD_1));

