wosayttn/M55M1BSP/_CUnit/i2s/i2s_cunit.c
        I2S_SetFIFO(pI2SModule, 1, 1);
        CU_ASSERT((pI2SModule->CTL1 & 0x000F0F00) == (I2S_FIFO_TX_LEVEL_WORD_1 | I2S_FIFO_RX_LEVEL_WORD_2));

        I2S_SetFIFO(pI2SModule, 2, 2);
        CU_ASSERT((pI2SModule->CTL1 & 0x000F0F00) == (I2S_FIFO_TX_LEVEL_WORD_2 | I2S_FIFO_RX_LEVEL_WORD_3));

        I2S_SetFIFO(pI2SModule, 3, 3);
        CU_ASSERT((pI2SModule->CTL1 & 0x000F0F00) == (I2S_FIFO_TX_LEVEL_WORD_3 | I2S_FIFO_RX_LEVEL_WORD_4));

        I2S_SetFIFO(pI2SModule, 4, 4);
        CU_ASSERT((pI2SModule->CTL1 & 0x000F0F00) == (I2S_FIFO_TX_LEVEL_WORD_4 | I2S_FIFO_RX_LEVEL_WORD_5));

        I2S_SetFIFO(pI2SModule, 5, 5);
        CU_ASSERT((pI2SModule->CTL1 & 0x000F0F00) == (I2S_FIFO_TX_LEVEL_WORD_5 | I2S_FIFO_RX_LEVEL_WORD_6));

        I2S_SetFIFO(pI2SModule, 6, 6);
        CU_ASSERT((pI2SModule->CTL1 & 0x000F0F00) == (I2S_FIFO_TX_LEVEL_WORD_6 | I2S_FIFO_RX_LEVEL_WORD_7));

        I2S_SetFIFO(pI2SModule, 7, 7);
        CU_ASSERT((pI2SModule->CTL1 & 0x000F0F00) == (I2S_FIFO_TX_LEVEL_WORD_7 | I2S_FIFO_RX_LEVEL_WORD_8));
    }
}

void API_I2S_SetTDM()
{
    uint32_t u32I2SIdx = 0;
    I2S_T *pI2SModule = NULL;

    for (u32I2SIdx = 0; u32I2SIdx < sizeof(g_apI2sModule) / sizeof(I2S_T *); u32I2SIdx++)
    {
        pI2SModule = (I2S_T *)GetI2SModuel(u32I2SIdx);

        I2S_ConfigureTDM(pI2SModule, I2S_TDM_WIDTH_8BIT, I2S_TDM_2CH, I2S_TDM_SYNC_ONE_BCLK);
        CU_ASSERT((pI2SModule->CTL0 & (I2S_CTL0_TDMCHNUM_Msk | I2S_CTL0_CHWIDTH_Msk | I2S_CTL0_PCMSYNC_Msk)) == 0);

        I2S_ConfigureTDM(pI2SModule, I2S_TDM_WIDTH_16BIT, I2S_TDM_4CH, I2S_TDM_SYNC_ONE_CHANNEL);
        CU_ASSERT((pI2SModule->CTL0 & (I2S_CTL0_TDMCHNUM_Msk | I2S_CTL0_CHWIDTH_Msk | I2S_CTL0_PCMSYNC_Msk)) == 0x58000000);

        I2S_ConfigureTDM(pI2SModule, I2S_TDM_WIDTH_24BIT, I2S_TDM_6CH, I2S_TDM_SYNC_ONE_CHANNEL);
        CU_ASSERT((pI2SModule->CTL0 & (I2S_CTL0_TDMCHNUM_Msk | I2S_CTL0_CHWIDTH_Msk | I2S_CTL0_PCMSYNC_Msk)) == 0xA8000000);

        I2S_ConfigureTDM(pI2SModule, I2S_TDM_WIDTH_32BIT, I2S_TDM_8CH, I2S_TDM_SYNC_ONE_CHANNEL);
        CU_ASSERT((pI2SModule->CTL0 & (I2S_CTL0_TDMCHNUM_Msk | I2S_CTL0_CHWIDTH_Msk | I2S_CTL0_PCMSYNC_Msk)) == 0xF8000000);
    }
}

CU_TestInfo I2S_MacroTests[] =
{

    {"Enable/Disable I2S TX zero-cross function", MACRO_I2S_ENABLE_DISABLE_TX_ZCD},
    {"Enable/Disable I2S TX PDMA function", MACRO_I2S_ENABLE_DISABLE_TXDMA},
    {"Enable/Disable I2S RX PDMA function", MACRO_I2S_ENABLE_DISABLE_RXDMA},
    {"Enable/Disable I2S TX function", MACRO_I2S_ENABLE_DISABLE_TX},
    {"Enable/Disable I2S RX function", MACRO_I2S_ENABLE_DISABLE_RX},
    {"Enable/Disable I2S TX mute function", MACRO_I2S_ENABLE_DISABLE_TX_MUTE},
    {"Clear I2S TX FIFO", MACRO_I2S_CLR_TX_FIFO},
    {"Clear I2S RX FIFO", MACRO_I2S_CLR_RX_FIFO},
    {"Select RX channel in I2S MONO mode", MACRO_I2S_SET_MONO_RX_CHANNEL},
    {"Write I2S TX FIFO", MACRO_I2S_WRITE_TX_FIFO},
    {"Read I2S RX FIFO", MACRO_I2S_READ_RX_FIFO},
    {"Get/Clear I2S interrupt flag", MACRO_I2S_GET_CLEAR_INT_FLAG},
    {"Get I2S TX FIFO level", MACRO_I2S_GET_TX_FIFO_LEVEL},
    {"Get I2S RX FIFO level", MACRO_I2S_GET_RX_FIFO_LEVEL},
    {"Set I2S FIFO threshold", API_I2S_SetFIFO},

    CU_TEST_INFO_NULL
};


CU_TestInfo I2S_ApiTests[] =
{

    {"I2S Open", API_I2S_Open},
    {"I2S Close", API_I2S_Close},
    {"Enable/Disable I2S interrupt function", API_I2S_EnableInt_DisableInt},
    {"Enable MCLK", API_I2S_EnableMCLK},
    {"Disable MCLK", API_I2S_DisableMCLK},
    {"Set I2S TDM parameters", API_I2S_SetTDM},

    CU_TEST_INFO_NULL
};



